Random Sample Imputation

- Assumption : The missing data are completely at Random(MCAR)

In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("/home/tejas.raval@simform.dom/Desktop/T's Notebook/Titanic-Dataset.csv",usecols=["Age","Fare","Survived"])

In [5]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [6]:
df.isnull().sum()

Survived      0
Age         177
Fare          0
dtype: int64

In [7]:
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [9]:
df[df['Age'].isnull()]

     Survived  Age     Fare
5           0  NaN   8.4583
17          1  NaN  13.0000
19          1  NaN   7.2250
26          0  NaN   7.2250
28          1  NaN   7.8792
..        ...  ...      ...
859         0  NaN   7.2292
863         0  NaN  69.5500
868         0  NaN   9.5000
878         0  NaN   7.8958
888         0  NaN  23.4500

[177 rows x 3 columns]

In [18]:
df['Age'].dropna().sample(df['Age'].isnull().sum(),random_state=5)

789    46.0
114    17.0
92     46.0
51     21.0
539    22.0
       ...
446    13.0
67     19.0
617    26.0
883    28.0
307    17.0
Name: Age, Length: 177, dtype: float64

In [20]:
def impute_nan(df,variable,median):
    df[variable+"_median"] = df[variable].fillna(median)
    df[variable+"_random"] = df[variable]
    random_sample = df[variable].dropna().sample(df[variable].isnull().sum(),random_state=5)
    random_sample.index = df[df[variable].isnull()].index
    df.loc[df[variable].isnull(),variable+'_random']=random_sample

In [19]:
median = df.Age.median()

In [21]:
impute_nan(df,"Age",median)

In [22]:
df.head()

   Survived   Age     Fare  Age_median  Age_random
0         0  22.0   7.2500        22.0        22.0
1         1  38.0  71.2833        38.0        38.0
2         1  26.0   7.9250        26.0        26.0
3         1  35.0  53.1000        35.0        35.0
4         0  35.0   8.0500        35.0        35.0

In [4]:
import matplotlib.pyplot as plt